gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/Wasserstand_V7.cpp
/*****************************************************************************************************************
 *****************************************************************************************************************
         M A I N L O O P
 *****************************************************************************************************************
 *****************************************************************************************************************/

void loop(void)
{

  // local variables
  PumpStatus pumpControl; // create a PumpControl object to manage pump states

  // Reset the Watchdog Timer at the beginning of each loop iteration
  if (simTimeout == 1)
  {
    delay((WDT_TIMEOUT + 1) * 1000); // wait for WDT_TIMEOUT plus 1 second to simulate a timeout
    simTimeout = 0;                  // reset the timeout flag
  }
  esp_task_wdt_reset();

  // **************************************************************************************************
  // ===============================================================================
  // following actions are triggered every 500 ms
  if (millis() - previousMillis_halfSecondAction > halfSecond)
  {

    /*=================================================================*/
    /*  code for getting time from NTP       */
    getEpochTime(epochTime);
    formatDateAndTime(formattedTime, currentDate, epochTime);
    /* End getting time and date */

    previousMillis_halfSecondAction = millis();
  }
  // ===============================================================================
  // **************************************************************************************************

  // ============================================================================
  // In simulation mode:
  //       Simulate level and relais outputs
  //
  //  GZE shift to a separat file
  // ============================================================================
  if (debugLevelSwitches != debugLevelSwitches_old)
  {
    if (debugLevelSwitches == 1)
    {
      // set default values to last actual values, when debug is switched on
      Serial.print("val_AHHH: ");
      Serial.println(val_AHHH);
      Serial.print("val_AHH:  ");
      Serial.println(val_AHH);
      Serial.print("val_AH:   ");
      Serial.println(val_AH);
      Serial.print("val_AL:   ");
      Serial.println(val_AL);
      // simVal_AHHH = val_AHHH;
      simVal_AHH = val_AHH;
      simVal_AH = val_AH;
      simVal_AL = val_AL;
      pinMode(GPin_AHHH, OUTPUT);
      pinMode(GPin_AHH, OUTPUT);
      pinMode(GPin_AH, OUTPUT);
      pinMode(GPin_AL, OUTPUT);

      // digitalWrite(GPin_AHHH, simVal_AHHH);
      digitalWrite(GPin_AHH, simVal_AHH);
      digitalWrite(GPin_AH, simVal_AH);
      digitalWrite(GPin_AL, simVal_AL);
      Serial.println("debug level enabled");
    }
    else
    {
      pinMode(GPin_AHHH, INPUT_PULLUP);
      pinMode(GPin_AHH, INPUT_PULLUP);
      pinMode(GPin_AH, INPUT_PULLUP);
      pinMode(GPin_AL, INPUT_PULLUP);
      Serial.println("debug level disabled");
    }
  }
  debugLevelSwitches_old = debugLevelSwitches;

  // **************************************************************************************************
  // **************************************************************************************************
  /* WebClient */

  seconds_since_startup = millis() / 1000;
  if ((clientIntervall > 0 && (seconds_since_startup - clientPreviousSs) >= clientIntervall)) // || (printOnChangeActive==1))
  {
    // sendPostToAskSensors(); // subscription cancelled

    if ((sendToClient == 1))
    {
      if (valueStable > 0)
      {
        sendPost(pumpControl);
        // sendPost_V2();
      }
    }
    clientPreviousSs = seconds_since_startup;
  }
  server.handleClient();
  ElegantOTA.loop();

  // **************************************************************************************************
  // **************************************************************************************************
  /* evaluate water level */
  // **************************************************************************************************

  Current2Waterlevel();

  SetAlarmState_from_relais();
  SetAlarmState_from_level();
  calculateWorstCaseAlarmState();

  prepareSendMail();

  // **************************************************************************************************
  // **************************************************************************************************
  /* Send Email reusing session   */
  // **************************************************************************************************

  if (executeSendMail)
  {
    SMTP_Message message;

    /* The attachment data item */
    SMTP_Attachment att[2];
    int attIndex = 0;
    // GZE  weitere Definitionen siehe ESP Mail Client/ examples / SMTP / Send_attachment_File

    message.sender.name = F("Pegel Zehentner");
    message.sender.email = AUTHOR_EMAIL;
    message.subject = subject;

    // somtimes we want to use web.de for test, because t-online has a huge delay
    if (useLiveMail == 1)
    {
      message.addRecipient(F("Schorsch"), RECIPIENT_EMAIL_LIVE);
    }
    else
    {
      message.addRecipient(F("Schorsch"), RECIPIENT_EMAIL);
    }

    // htmlMsg already set by Evaluate Sensor
    message.html.content = htmlMsg;
    message.text.content = F("");

    Serial.println();
    Serial.println(F("Sending Email..."));

    if (!smtp.isLoggedIn())
    {
      /* Set the TCP response read timeout in seconds */
      smtp.setTCPTimeout(10);

      if (!smtp.connect(&config))
      {
        MailClient.printf("Connection error, Status Code: %d, Error Code: %d, Reason: %s\n", smtp.statusCode(), smtp.errorCode(), smtp.errorReason().c_str());
        goto exit;
      }

      if (!smtp.isLoggedIn())
      {
        Serial.println(F("Error, Not yet logged in."));
        goto exit;
      }
      else
      {
        if (smtp.isAuthenticated())
          Serial.println(F("Successfully logged in."));
        else
          Serial.println(F("Connected with no Auth."));
      }
    }

